STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_ANCS_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    gatt_client_app.c
  * @author  MCD Application Team
  * @brief   GATT Client Application
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"
#include "app_common.h"
#include "ble.h"
#include "gatt_client_app.h"
#include "stm32_seq.h"
#include "app_ble.h"
#include "ble_evt.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */

typedef enum {
    EventIDNotificationAdded = 0,
    EventIDNotificationModified = 1,
    EventIDNotificationRemoved = 2,
    ReservedEventID = 3 // Reserved values from 3 to 255
} EventID;

typedef enum {
    EventFlagSilent = (1 << 0),
    EventFlagImportant = (1 << 1),
    EventFlagPreExisting = (1 << 2),
    EventFlagPositiveAction = (1 << 3),
    EventFlagNegativeAction = (1 << 4),
    ReservedEventFlags = (1 << 5) // Reserved values from (1 << 5) to (1 << 7)
} EventFlags;

typedef enum {
    CommandIDGetNotificationAttributes = 0,
    CommandIDGetAppAttributes = 1,
    CommandIDPerformNotificationAction = 2,
    ReservedCommandID = 3 // Reserved values from 3 to 255
} CommandID;

typedef enum {
    CategoryIDOther = 0,
    CategoryIDIncomingCall = 1,
    CategoryIDMissedCall = 2,
    CategoryIDVoicemail = 3,
    CategoryIDSocial = 4,
    CategoryIDSchedule = 5,
    CategoryIDEmail = 6,
    CategoryIDNews = 7,
    CategoryIDHealthAndFitness = 8,
    CategoryIDBusinessAndFinance = 9,
    CategoryIDLocation = 10,
    CategoryIDEntertainment = 11,
    ReservedCategoryID = 12 // Reserved values from 12 to 255
} CategoryID;

typedef enum {
    NotificationAttributeIDAppIdentifier = 0,
    NotificationAttributeIDTitle = 1, // Needs to be followed by a 2-bytes max length parameter
    NotificationAttributeIDSubtitle = 2, // Needs to be followed by a 2-bytes max length parameter
    NotificationAttributeIDMessage = 3, // Needs to be followed by a 2-bytes max length parameter
    NotificationAttributeIDMessageSize = 4,
    NotificationAttributeIDDate = 5,
    NotificationAttributeIDPositiveActionLabel = 6,
    NotificationAttributeIDNegativeActionLabel = 7,
    ReservedNotificationAttributeID = 8 // Reserved values from 8 to 255
} NotificationAttributeID;

typedef enum {
    ActionIDPositive = 0,
    ActionIDNegative = 1,
    ReservedActionID = 2 // Reserved values from 2 to 255
} ActionID;

typedef enum {
    AppAttributeIDDisplayName = 0,
    ReservedAppAttributeID = 1 // Reserved values from 1 to 255
} AppAttributeID;

typedef enum {
  UNUSED = 0,
  USED = 1
} UsedStatus;

typedef enum {
  EMPTY = 0,
  ADDED,
  GET_NOTIFICATION_ATTRIBUTES,
  TO_UPDATE
} RequestStatus;

/* USER CODE END PTD */

typedef enum
{
  NOTIFICATION_INFO_RECEIVED_EVT,
  /* USER CODE BEGIN GATT_CLIENT_APP_Opcode_t */
  ANCS_NOTIFICATION_INFO_RECEIVED_EVT,
  ANCS_GET_NOTIFICATION_ATTRIBUTES_RECEIVED_EVT,
  /* USER CODE END GATT_CLIENT_APP_Opcode_t */
}GATT_CLIENT_APP_Opcode_t;

typedef struct
{
  uint8_t *p_Payload;
  uint8_t length;
}GATT_CLIENT_APP_Data_t;

typedef struct
{
  GATT_CLIENT_APP_Opcode_t Client_Evt_Opcode;
  GATT_CLIENT_APP_Data_t   DataTransfered;
}GATT_CLIENT_APP_Notification_evt_t;

typedef struct
{
  GATT_CLIENT_APP_State_t state;

  APP_BLE_ConnStatus_t connStatus;
  uint16_t connHdl;

  uint16_t ALLServiceStartHdl;
  uint16_t ALLServiceEndHdl;

  uint16_t GAPServiceStartHdl;
  uint16_t GAPServiceEndHdl;

  uint16_t GATTServiceStartHdl;
  uint16_t GATTServiceEndHdl;

  uint16_t ServiceChangedCharStartHdl;
  uint16_t ServiceChangedCharValueHdl;
  uint16_t ServiceChangedCharDescHdl;
  uint16_t ServiceChangedCharEndHdl;

  /* USER CODE BEGIN BleClientAppContext_t */

  /* Handles of ANCS service */
  uint16_t ANCSServiceHdl;
  uint16_t ANCSServiceEndHdl;

  /* Handles of the Notification Source characteristic */
  uint16_t ANCSNotificationSourceCharHdl;
  uint16_t ANCSNotificationSourceValueHdl;
  uint16_t ANCSNotificationSourceCCCDHdl;

  /* Handles of the Control Point characteristic */
  uint16_t ANCSControlPointCharHdl;
  uint16_t ANCSControlPointValueHdl;

  /* Handles of the Control Point Extended characteristic */
  uint16_t ANCSControlPointExtendedCharHdl;
  uint16_t ANCSControlPointExtendedValueHdl;

  /* Handles of the Data Source characteristic */
  uint16_t ANCSDataSourceCharHdl;
  uint16_t ANCSDataSourceValueHdl;
  uint16_t ANCSDataSourceCCCDHdl;

  uint8_t ANCSerror_proc;
  uint8_t ANCSservicePresent;

/* USER CODE END BleClientAppContext_t */

}BleClientAppContext_t;

/* Private defines ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define ANCS_UUID        0x79, 0x05, 0xF4, 0x31, 0xB5, 0xCE, 0x4E, 0x99, 0xA4, 0x0F, 0x4B, 0x1E, 0x12, 0x2D, 0x00, 0xD0
#define NOTIFICATION_CHAR_UUID   0x9F, 0xBF, 0x12, 0x0D, 0x63, 0x01, 0x42, 0xD9, 0x8C, 0x58, 0x25, 0xE6, 0x99, 0xA2, 0x1D, 0xBD
#define CONTROL_POINT_CHAR_UUID  0x69, 0xD1, 0xD8, 0xF3, 0x45, 0xE1, 0x49, 0xA8, 0x98, 0x21, 0x9B, 0xBD, 0xFD, 0xAA, 0xD9, 0xD9
#define DATA_SOURCE_CHAR_UUID    0x22, 0xEA, 0xC6, 0xE9, 0x24, 0xD6, 0x4B, 0xB5, 0xBE, 0x44, 0xB3, 0x6A, 0xCE, 0x7C, 0x7B, 0xFB

/* Implementation define */
#define MIN_DATA_BUFFER_SIZE 20
#define NOTIFY_SOURCE_DATA_LEN 8

#define ERROR_ANCS_NOT_PRESENT                   0x01
#define ERROR_ANCS_CONSUMER_ALREADY_SET          0x02
#define ERROR_MORE_THAN_ONE_ANCS_PRESENT         0x03
#define ERROR_WRONG_CONN_HANDLE                  0x04
#define ERROR_WRONG_CHARAC_PROP                  0x05
#define ERROR_ANCS_DISCOVERY_SERVICE             0x06
#define ERROR_ANCS_DISCOVERY_CHARACTERISTICS     0x07
#define ERROR_ANCS_DISCOVERY_EXTENDED_PROP       0x08
#define ERROR_ANCS_READ_PROC                     0x09
#define ERROR_ANCS_WRITE_PROC                    0x0A
#define ERROR_ANCS_DISCOVERY_CHARACTERISTIC_DESC 0x0B
#define ERROR_ANCS_BUSY                          0x0C
#define ERROR_INSUFFICIENT_MEMORY_SIZE           0x0D
#define ERROR_WRONG_NOTIFICATION_LENGTH          0x0E

#define COMMAND_DATA_SIZE                        (14U)
#define ANCS_APP_IDENTIFIER                     (100U)
#define ANCS_TITLE_MAX_LENGTH                    (50U)
#define ANCS_SUBTITLE_MAX_LENGTH                 (30U)
#define ANCS_MESSAGE_MAX_LENGTH                 (300U)
/* ANCS_MESSAGE_MAX_LENGTH is 300 characters. This value in hexadecimal is equal to 0x012C, the value to write in the notification command data */
#define ANCS_MESSAGE_MAX_LENGTH_LSB               0x2C
#define ANCS_MESSAGE_MAX_LENGTH_MSB               0x01
#define MAX_ANCS_NOTIFICATION                    (10U)

/* USER CODE END PD */

/* Private macros -------------------------------------------------------------*/
#define UNPACK_2_BYTE_PARAMETER(ptr)  \
        (uint16_t)((uint16_t)(*((uint8_t *)ptr))) |   \
        (uint16_t)((((uint16_t)(*((uint8_t *)ptr + 1))) << 8))
/* USER CODE BEGIN PM */
#define UNPACK_4_BYTE_PARAMETER(ptr) \
    (uint32_t)((uint32_t)(ptr[0]) | \
    ((uint32_t)(ptr[1]) << 8) | \
    ((uint32_t)(ptr[2]) << 16) | \
    ((uint32_t)(ptr[3]) << 24))

