STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_ANCS_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
typedef struct NotificationAttributeDataS
{
  uint8_t appIdentifier[ANCS_APP_IDENTIFIER];
  uint8_t idTitle[ANCS_TITLE_MAX_LENGTH];
  uint8_t idSubtitle[ANCS_SUBTITLE_MAX_LENGTH];
  uint8_t idMessage[ANCS_MESSAGE_MAX_LENGTH];
  uint8_t idMessageSize[2];
  uint8_t idDate[15];
  uint8_t actionLabel;
  uint8_t idNegativeActionLabel[10];
  uint8_t idPositiveActionLabel[10];
} NotificationAttributeData_type;

typedef struct ANCS_NotificationListS
{
  RequestStatus status;
  uint8_t used;
  EventID evID;
  EventFlags evFlag;
  CategoryID catID;
  uint8_t catCount;
  uint32_t notifUID;
  NotificationAttributeData_type notifData;
} ANCS_NotificationList_type;

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

static BleClientAppContext_t a_ClientContext[GATT_CLT_MAX_NUM_SERVERS];
static uint16_t gattCharStartHdl = 0;
static uint16_t gattCharValueHdl = 0;

/* USER CODE BEGIN PV */
uint8_t ancs_service_uuid[16] = {ANCS_UUID};
uint8_t notification_char_uuid[16] = {NOTIFICATION_CHAR_UUID};
uint8_t control_point_char_uuid[16] = {CONTROL_POINT_CHAR_UUID};
uint8_t data_source_char_uuid[16] = {DATA_SOURCE_CHAR_UUID};

ANCS_NotificationList_type ancs_notification_list[MAX_ANCS_NOTIFICATION];

/* USER CODE END PV */

/* Global variables ----------------------------------------------------------*/

/* USER CODE BEGIN GV */

/* USER CODE END GV */

/* Private function prototypes -----------------------------------------------*/

static BLEEVT_EvtAckStatus_t P2P_ROUTER_EventHandler(aci_blecore_event *p_evt);
static void gatt_parse_services(aci_att_clt_read_by_group_type_resp_event_rp0 *p_evt);
static void gatt_parse_services_by_UUID(aci_att_clt_find_by_type_value_resp_event_rp0 *p_evt);
static void gatt_parse_chars(aci_att_clt_read_by_type_resp_event_rp0 *p_evt);
static void gatt_parse_descs(aci_att_clt_find_info_resp_event_rp0 *p_evt);
static void gatt_parse_notification(aci_gatt_clt_notification_event_rp0 *p_evt);
static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif);
static void client_discover_all(void);
static void gatt_cmd_resp_release(void);
static void gatt_cmd_resp_wait(void);
/* USER CODE BEGIN PFP */

static void client_discover_ancs(void);
void GATT_Button1Action(void);
void GATT_Button2Action(void);
void GATT_Button3Action(void);
static void notification_ancs(void);
void aci_att_clt_find_by_type_value_resp_event(aci_att_clt_find_by_type_value_resp_event_rp0 *p_event);
void aci_gatt_clt_disc_read_char_by_uuid_resp_event(aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0 *p_event);
void aci_att_clt_find_info_resp_event(aci_att_clt_find_info_resp_event_rp0 *p_event);
void aci_att_clt_read_resp_event(aci_att_clt_read_resp_event_rp0 *p_event);
void aci_gatt_clt_indication_event(aci_gatt_clt_indication_event_rp0 *p_event);
void gatt_ShowANCSPacket(ANCS_NotificationList_type *notification);
void printANCSNotification(ANCS_NotificationList_type *notification);
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
/**
 * @brief  Service initialization
 * @param  None
 * @retval None
 */
void GATT_CLIENT_APP_Init(void)
{
  uint8_t index =0;
  int ret;

  /* USER CODE BEGIN GATT_CLIENT_APP_Init_1 */
  for (index = 0; index < GATT_CLT_MAX_NUM_SERVERS; index++)
  {
    a_ClientContext[0].ANCSservicePresent = FALSE;

    /* Handles of ANCS service */
    a_ClientContext[index].ANCSServiceHdl = 0;
    a_ClientContext[index].ANCSServiceEndHdl = 0;
    /* Handles of the Notification Source characteristic */
    a_ClientContext[index].ANCSNotificationSourceCharHdl = 0;
    a_ClientContext[index].ANCSNotificationSourceValueHdl = 0;
    a_ClientContext[index].ANCSNotificationSourceCCCDHdl = 0;
    /* Handles of the Control Point characteristic */
    a_ClientContext[index].ANCSControlPointCharHdl = 0;
    a_ClientContext[index].ANCSControlPointValueHdl = 0;
    /* Handles of the Control Point Extended characteristic */
    a_ClientContext[index].ANCSControlPointExtendedCharHdl = 0;
    a_ClientContext[index].ANCSControlPointExtendedValueHdl = 0;
    /* Handles of the Data Source characteristic */
    a_ClientContext[index].ANCSDataSourceCharHdl = 0;
    a_ClientContext[index].ANCSDataSourceValueHdl = 0;
    a_ClientContext[index].ANCSDataSourceCCCDHdl = 0;

    a_ClientContext[index].ANCSerror_proc = 0;
    a_ClientContext[index].ANCSservicePresent = 0;
  }

  /* To reset the ANCS structure, it is only required to set the variable that stores all notification data as UNUSED */
  for (index = 0; index < MAX_ANCS_NOTIFICATION; index++)
  {
    ancs_notification_list[index].used = UNUSED;
  }

  /* USER CODE END GATT_CLIENT_APP_Init_1 */

  for(index = 0; index < GATT_CLT_MAX_NUM_SERVERS; index++)
  {
    a_ClientContext[index].connStatus = APP_BLE_IDLE;
  }

  /**
   *  Register the event handler to the BLE controller
   */
  ret = BLEEVT_RegisterGattEvtHandler(P2P_ROUTER_EventHandler);
  if (ret != 0)
  {
    Error_Handler();
  }
  /* Register a task allowing to discover all services and characteristics and enable all notifications */
  UTIL_SEQ_RegTask(1U << CFG_TASK_DISCOVER_SERVICES_ID, UTIL_SEQ_RFU, client_discover_all);

  /* USER CODE BEGIN GATT_CLIENT_APP_Init_2 */

  UTIL_SEQ_RegTask(1U << CFG_TASK_CLIENT_DISCOVER_ANCS, UTIL_SEQ_RFU, client_discover_ancs);

  UTIL_SEQ_RegTask(1U << CFG_TASK_GATT_CLIENT_BUTTON_1, UTIL_SEQ_RFU, GATT_Button1Action);
  UTIL_SEQ_RegTask(1U << CFG_TASK_GATT_CLIENT_BUTTON_2, UTIL_SEQ_RFU, GATT_Button2Action);
  UTIL_SEQ_RegTask(1U << CFG_TASK_GATT_CLIENT_BUTTON_3, UTIL_SEQ_RFU, GATT_Button3Action);
  UTIL_SEQ_RegTask(1U << CFG_TASK_NOTIFICATION_ANCS, UTIL_SEQ_RFU, notification_ancs);
  

  /* USER CODE END GATT_CLIENT_APP_Init_2 */
  return;
}

void GATT_CLIENT_APP_Notification(GATT_CLIENT_APP_ConnHandle_Notif_evt_t *p_Notif)
{
  /* USER CODE BEGIN GATT_CLIENT_APP_Notification_1 */

  /* USER CODE END GATT_CLIENT_APP_Notification_1 */
  switch(p_Notif->ConnOpcode)
  {
    /* USER CODE BEGIN ConnOpcode */

    /* USER CODE END ConnOpcode */

