STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_ANCS_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
  return status;
}

/* USER CODE BEGIN FD */

/* USER CODE END FD */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Event handler
 * @param  Event: Address of the buffer holding the Event
 * @retval Ack: Return whether the Event has been managed or not
 */
static BLEEVT_EvtAckStatus_t P2P_ROUTER_EventHandler(aci_blecore_event *p_evt)
{
  BLEEVT_EvtAckStatus_t return_value = BLEEVT_NoAck;
  GATT_CLIENT_APP_Notification_evt_t Notification;
  UNUSED(Notification);

  return_value = BLEEVT_NoAck;

  switch (p_evt->ecode)
  {
    case ACI_ATT_CLT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_by_group_type_resp_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_services((aci_att_clt_read_by_group_type_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE */
  case ACI_ATT_CLT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE:
    {
      aci_att_clt_find_by_type_value_resp_event_rp0 *p_evt_rsp = (void*) p_evt->data;
      gatt_parse_services_by_UUID((aci_att_clt_find_by_type_value_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_FIND_BY_TYPE_VALUE_RESP_VSEVT_CODE */
    case ACI_ATT_CLT_READ_BY_TYPE_RESP_VSEVT_CODE:
    {
      aci_att_clt_read_by_type_resp_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_chars((aci_att_clt_read_by_type_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE */
    case ACI_ATT_CLT_FIND_INFO_RESP_VSEVT_CODE:
    {
      aci_att_clt_find_info_resp_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_descs((aci_att_clt_find_info_resp_event_rp0 *)p_evt_rsp);
    }
    break; /* ACI_ATT_FIND_INFO_RESP_VSEVT_CODE */
    case ACI_GATT_CLT_NOTIFICATION_VSEVT_CODE:
    {
      aci_gatt_clt_notification_event_rp0 *p_evt_rsp = (void*)p_evt->data;
      gatt_parse_notification((aci_gatt_clt_notification_event_rp0 *)p_evt_rsp);
    }
    break;/* ACI_GATT_NOTIFICATION_VSEVT_CODE */
    case ACI_GATT_CLT_PROC_COMPLETE_VSEVT_CODE:
    {
      aci_gatt_clt_proc_complete_event_rp0 *p_evt_rsp = (void*)p_evt->data;

      uint8_t index;
      for (index = 0 ; index < GATT_CLT_MAX_NUM_SERVERS ; index++)
      {
        if (a_ClientContext[index].connHdl == p_evt_rsp->Connection_Handle)
        {
          break;
        }
      }

      if (a_ClientContext[index].connHdl == p_evt_rsp->Connection_Handle)
      {
        gatt_cmd_resp_release();
      }
    }
    break;/* ACI_GATT_PROC_COMPLETE_VSEVT_CODE */
    case ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE:
    {
    aci_att_exchange_mtu_resp_event_rp0 *tx_pool_available;
    tx_pool_available = (aci_att_exchange_mtu_resp_event_rp0 *)p_evt->data;
    UNUSED(tx_pool_available);
    /* USER CODE BEGIN ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */

    /* USER CODE END ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE */
    }
    break;/* ACI_GATT_TX_POOL_AVAILABLE_VSEVT_CODE*/
    case ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE:
    {
    aci_att_exchange_mtu_resp_event_rp0 * exchange_mtu_resp;
    exchange_mtu_resp = (aci_att_exchange_mtu_resp_event_rp0 *)p_evt->data;
    APP_DBG_MSG("  MTU exchanged size = %d\n",exchange_mtu_resp->MTU );
    UNUSED(exchange_mtu_resp);
    /* USER CODE BEGIN ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */

    /* USER CODE END ACI_ATT_EXCHANGE_MTU_RESP_VSEVT_CODE */
    }
    break;
    /* USER CODE BEGIN BLECORE_EVT */

    /*
     * Handle the event for discovering characteristics by UUID response.
     * This case handles the event code ACI_GATT_CLT_DISC_READ_CHAR_BY_UUID_RESP_VSEVT_CODE.
     * It processes the response of a GATT client characteristic discovery by UUID.
     * The function aci_gatt_clt_disc_read_char_by_uuid_resp_event() is called to handle the event.
     * The attribute handle of the discovered characteristic is logged for debugging purposes.
     */
  case ACI_GATT_CLT_DISC_READ_CHAR_BY_UUID_RESP_VSEVT_CODE:
  {
    aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0 *p_disc_read_char_by_uuid_resp;
    p_disc_read_char_by_uuid_resp = (aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0 *)p_evt->data;
    aci_gatt_clt_disc_read_char_by_uuid_resp_event(p_disc_read_char_by_uuid_resp);
    break;
  }

    /*
     * Handle the ACI_ATT_CLT_READ_RESP_VSEVT_CODE event.
     * This case handles the ACI_ATT_CLT_READ_RESP_VSEVT_CODE event by
     * processing the response data and calling the appropriate function to
     * handle the read response event.
     * The function aci_att_clt_read_resp_event is called with the
     * parsed response data.
     */
  case ACI_ATT_CLT_READ_RESP_VSEVT_CODE:
  {
    aci_att_clt_read_resp_event_rp0 *p_read_resp;
    p_read_resp = (aci_att_clt_read_resp_event_rp0 *)p_evt->data;
    aci_att_clt_read_resp_event(p_read_resp);
    break;
  }

  case ACI_GATT_CLT_INDICATION_VSEVT_CODE:
  {
    aci_gatt_clt_indication_event_rp0 *p_indication_event;
    p_indication_event = (aci_gatt_clt_indication_event_rp0 *)p_evt->data;
    aci_gatt_clt_indication_event(p_indication_event);
    break;
  }

    /* USER CODE END BLECORE_EVT */
    default:
      APP_DBG_MSG("EVENT OPCODE: 0x%04X\n", p_evt->ecode);
      break;
  }/* end switch (p_evt->ecode) */

  return(return_value);
}

__USED static void gatt_Notification(GATT_CLIENT_APP_Notification_evt_t *p_Notif)
{
  /* USER CODE BEGIN gatt_Notification_1*/

  /* USER CODE END gatt_Notification_1 */
  switch (p_Notif->Client_Evt_Opcode)
  {
    /* USER CODE BEGIN Client_Evt_Opcode */
  case ANCS_NOTIFICATION_INFO_RECEIVED_EVT:
    /**
     * @brief This structure represents the ANCS (Apple Notification Center Service) notification payload.
     * 
     * The `p_Notif->DataTransfered.p_Payload` contains the ANCS notification data. The payload is structured as follows:
     * 
     * Byte 0: Event ID - Indicates the type of event (e.g., notification added, modified, or removed).
     * Byte 1: Event Flags - Provides additional information about the event (e.g., silent, important).
     * Byte 2: Category ID - Specifies the category of the notification (e.g., incoming call, missed call).
     * Byte 3: Category Count - Number of active notifications in the given category.
     * Bytes 4-7: Notification UID - A unique identifier for the notification.
     * Bytes 8-n: Notification Attributes - Contains various attributes of the notification such as title, message, etc.
     * 
     * The exact length and content of the notification attributes depend on the specific notification and its attributes.
     */

