STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_ANCS_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
    /* Event ID switch case */
    switch (p_Notif->DataTransfered.p_Payload[0])
    {
      case EventIDNotificationAdded:
        {
          uint8_t found=0;
          /* Handle notification added event */
          for(uint8_t index=0; index<MAX_ANCS_NOTIFICATION; index++)
          {
            if(ancs_notification_list[index].used == UNUSED)
            {
              found=1;
              ancs_notification_list[index].used = USED;
              ancs_notification_list[index].status = ADDED;
              ancs_notification_list[index].evID = (EventID) p_Notif->DataTransfered.p_Payload[0];
              ancs_notification_list[index].evFlag = (EventFlags) p_Notif->DataTransfered.p_Payload[1];
              ancs_notification_list[index].catID = (CategoryID) p_Notif->DataTransfered.p_Payload[2];
              ancs_notification_list[index].catCount = p_Notif->DataTransfered.p_Payload[3];
              uint8_t *ptr = 0x0;
              ptr = &(p_Notif->DataTransfered.p_Payload[4]);
              ancs_notification_list[index].notifUID = UNPACK_4_BYTE_PARAMETER(ptr);
              APP_DBG_MSG("Notification ADDED.\n");

              APP_DBG_MSG("Notification : EventID             0x%02X\n", ancs_notification_list[index].evID);
              APP_DBG_MSG("               EventFlags          0x%02X\n", ancs_notification_list[index].evFlag);
              APP_DBG_MSG("               CategoryID          0x%02X\n", ancs_notification_list[index].catID);
              APP_DBG_MSG("               CategoryCount       0x%02X\n", ancs_notification_list[index].catCount);
              APP_DBG_MSG("               UID           0x%08X\n", ancs_notification_list[index].notifUID);

              UTIL_SEQ_SetTask(1U << CFG_TASK_NOTIFICATION_ANCS, CFG_SEQ_PRIO_0);

              break;
            }
          }
          if(found==0)
          {
            APP_DBG_MSG("Notification NOT ADDED to the notification stored on the device. Handle notification cannot be added. All notifications data structure is used. The limit is %d notifications.\n", MAX_ANCS_NOTIFICATION);
          }
        }
        break;
      case EventIDNotificationModified:
        /* Handle notification modified event */
        {
          uint8_t *ptr = 0x0;
          ptr = &(p_Notif->DataTransfered.p_Payload[4]);
          uint32_t notification_uid = UNPACK_4_BYTE_PARAMETER(ptr);
          for(uint8_t index=0; index<MAX_ANCS_NOTIFICATION; index++)
          {
            if(ancs_notification_list[index].notifUID == notification_uid)
            {
              APP_DBG_MSG("Notification MODIFIED\n");
              APP_DBG_MSG("notification_uid = 0x%08X\n", notification_uid);
              ancs_notification_list[index].status = TO_UPDATE;
              UTIL_SEQ_SetTask(1U << CFG_TASK_NOTIFICATION_ANCS, CFG_SEQ_PRIO_0);
            }
          }
        }
        break;
      case EventIDNotificationRemoved:
        /* Handle notification removed event */
        {
          uint8_t *ptr = 0x0;
          ptr = &(p_Notif->DataTransfered.p_Payload[4]);
          uint32_t notification_uid = UNPACK_4_BYTE_PARAMETER(ptr);
          for(uint8_t index=0; index<MAX_ANCS_NOTIFICATION; index++)
          {
            if(ancs_notification_list[index].notifUID == notification_uid)
            {
              APP_DBG_MSG("Notification REMOVED\n");
              APP_DBG_MSG("notification_uid = 0x%08X\n", notification_uid);
              ancs_notification_list[index].used = UNUSED;
            }
          }
        }
        break;
      default:
        APP_DBG_MSG("Event ID switch case : Handle (0x%02X) reserved event IDs or unknown event\n", p_Notif->DataTransfered.p_Payload[0]);
        break;
    }
    break; /* ANCS_NOTIFICATION_INFO_RECEIVED_EVT */
    
    case ANCS_GET_NOTIFICATION_ATTRIBUTES_RECEIVED_EVT:
    {
      uint32_t notification_uid = (uint32_t)p_Notif->DataTransfered.p_Payload[1] | ((uint32_t)p_Notif->DataTransfered.p_Payload[2] << 8) | ((uint32_t)p_Notif->DataTransfered.p_Payload[3] << 16) | ((uint32_t)p_Notif->DataTransfered.p_Payload[4] << 24);
      APP_DBG_MSG("notification_uid = 0x%08X\n", notification_uid);
      for(uint8_t index=0; index<MAX_ANCS_NOTIFICATION; index++)
      {
        if(ancs_notification_list[index].notifUID == notification_uid)
        {
          uint16_t dim = 0;
          uint16_t i = 0;
          APP_DBG_MSG("ancs_notification_list[%d].notifUID = 0x%08X\n", index, ancs_notification_list[index].notifUID);
          /* NotificationAttributeIDAppIdentifier  */
          if(p_Notif->DataTransfered.p_Payload[5] == NotificationAttributeIDAppIdentifier)
          {
            dim = (uint16_t)p_Notif->DataTransfered.p_Payload[6] | (uint16_t)((p_Notif->DataTransfered.p_Payload[7]) << 8);
            i = 8;
            for(uint16_t j=0 ; j<dim; j++)
            {
              ancs_notification_list[index].notifData.appIdentifier[j] = p_Notif->DataTransfered.p_Payload[i++];
            }
            ancs_notification_list[index].notifData.appIdentifier[dim] = '\0';
          }
          
          /* NotificationAttributeIDTitle */
          if(p_Notif->DataTransfered.p_Payload[i+0] == NotificationAttributeIDTitle)
          {
            dim = (uint16_t)p_Notif->DataTransfered.p_Payload[i+1] | (uint16_t)((p_Notif->DataTransfered.p_Payload[i+2]) << 8);
            i = i + 3;
            for(uint16_t j=0 ; j<dim; j++)
            {
              ancs_notification_list[index].notifData.idTitle[j] = p_Notif->DataTransfered.p_Payload[i++];
            }
            ancs_notification_list[index].notifData.idTitle[dim] = '\0';
          }
          
          /* NotificationAttributeIDSubtitle */
          if(p_Notif->DataTransfered.p_Payload[i+0] == NotificationAttributeIDSubtitle)
          {
            dim = (uint16_t)p_Notif->DataTransfered.p_Payload[i+1] | (uint16_t)((p_Notif->DataTransfered.p_Payload[i+2]) << 8);
            i = i + 3;
            for(uint16_t j=0 ; j<dim; j++)
            {
              ancs_notification_list[index].notifData.idSubtitle[j] = p_Notif->DataTransfered.p_Payload[i++];
            }
            ancs_notification_list[index].notifData.idSubtitle[dim] = '\0';
          }

          /* NotificationAttributeIDMessage */
          if(p_Notif->DataTransfered.p_Payload[i+0] == NotificationAttributeIDMessage)
          {
            dim = (uint16_t)p_Notif->DataTransfered.p_Payload[i+1] | (uint16_t)((p_Notif->DataTransfered.p_Payload[i+2]) << 8);
            i = i + 3;
            for(uint16_t j=0 ; j<dim; j++)
            {
              ancs_notification_list[index].notifData.idMessage[j] = p_Notif->DataTransfered.p_Payload[i++];
            }
            ancs_notification_list[index].notifData.idMessage[dim] = '\0';
          }

          /* NotificationAttributeIDMessageSize */
          if(p_Notif->DataTransfered.p_Payload[i+0] == NotificationAttributeIDMessageSize)
          {
            dim = (uint16_t)p_Notif->DataTransfered.p_Payload[i+1] | (uint16_t)((p_Notif->DataTransfered.p_Payload[i+2]) << 8);
            i = i + 3;
            for(uint16_t j=0 ; j<dim; j++)
            {
              ancs_notification_list[index].notifData.idMessageSize[j] = p_Notif->DataTransfered.p_Payload[i++];
            }
            ancs_notification_list[index].notifData.idMessageSize[dim] = '\0';
          }

          /* NotificationAttributeIDDate */
          if(p_Notif->DataTransfered.p_Payload[i+0] == NotificationAttributeIDDate)
          {
            dim = (uint16_t)p_Notif->DataTransfered.p_Payload[i+1] | (uint16_t)((p_Notif->DataTransfered.p_Payload[i+2]) << 8);
            i = i + 3;
            for(uint16_t j=0 ; j<dim; j++)
            {
              ancs_notification_list[index].notifData.idDate[j] = p_Notif->DataTransfered.p_Payload[i++];
            }
            ancs_notification_list[index].notifData.idDate[dim] = '\0';
          }

          /* NotificationAttributeIDPositiveActionLabel */
          if(p_Notif->DataTransfered.p_Payload[i+0] == NotificationAttributeIDPositiveActionLabel)
          {
            dim = (uint16_t)p_Notif->DataTransfered.p_Payload[i+1] | (uint16_t)((p_Notif->DataTransfered.p_Payload[i+2]) << 8);
            i = i + 3;
            for(uint16_t j=0 ; j<dim; j++)
            {
              ancs_notification_list[index].notifData.idPositiveActionLabel[j] = p_Notif->DataTransfered.p_Payload[i++];
            }
            ancs_notification_list[index].notifData.idPositiveActionLabel[dim] = '\0';
          }

          /* NotificationAttributeIDNegativeActionLabel */
          if(p_Notif->DataTransfered.p_Payload[i+0] == NotificationAttributeIDNegativeActionLabel)
          {
            dim = (uint16_t)p_Notif->DataTransfered.p_Payload[i+1] | (uint16_t)((p_Notif->DataTransfered.p_Payload[i+2]) << 8);
            i = i + 3;
            for(uint16_t j=0 ; j<dim; j++)
            {
              ancs_notification_list[index].notifData.idNegativeActionLabel[j] = p_Notif->DataTransfered.p_Payload[i++];
            }
            ancs_notification_list[index].notifData.idNegativeActionLabel[dim] = '\0';
          }

          APP_DBG_MSG("Notification Attributes:\n");
          APP_DBG_MSG("  AppIdentifier: %s\n", ancs_notification_list[index].notifData.appIdentifier); 
          printANCSNotification(&ancs_notification_list[index]);
        }
      }
    }
    break; /* ANCS_GET_NOTIFICATION_ATTRIBUTES_RECEIVED_EVT */   
    /* USER CODE END Client_Evt_Opcode */

    case NOTIFICATION_INFO_RECEIVED_EVT:
      /* USER CODE BEGIN NOTIFICATION_INFO_RECEIVED_EVT */

      /* USER CODE END NOTIFICATION_INFO_RECEIVED_EVT */
      break;

    default:
      /* USER CODE BEGIN Client_Evt_Opcode_Default */

      /* USER CODE END Client_Evt_Opcode_Default */
      break;
  }
  /* USER CODE BEGIN gatt_Notification_2*/

  /* USER CODE END gatt_Notification_2 */
  return;
}

/**
* function of GATT service parse
*/
static void gatt_parse_services(aci_att_clt_read_by_group_type_resp_event_rp0 *p_evt)
{
  uint16_t uuid, ServiceStartHdl, ServiceEndHdl;
  uint8_t uuid_offset, uuid_size, uuid_short_offset;
  uint8_t i, idx, numServ, index;

  APP_DBG_MSG("ACI_ATT_READ_BY_GROUP_TYPE_RESP_VSEVT_CODE - ConnHdl=0x%04X\n",
                p_evt->Connection_Handle);

