STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_ANCS_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
      }
      uuid_offset += p_evt->Handle_Value_Pair_Length;
    }
  }
  else
  {
    APP_DBG_MSG("ACI_ATT_READ_BY_TYPE_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
  }

  return;
}
/**
* function of GATT descriptor parse
*/
static void gatt_parse_descs(aci_att_clt_find_info_resp_event_rp0 *p_evt)
{
  uint16_t uuid, handle;
  uint8_t uuid_offset, uuid_size, uuid_short_offset;
  uint8_t i, numDesc, handle_uuid_pair_size, index;

  APP_DBG_MSG("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE - ConnHdl=0x%04X\n",
              p_evt->Connection_Handle);

  for (index = 0 ; index < GATT_CLT_MAX_NUM_SERVERS ; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      break;
    }
  }

  if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
  {
    /* event data in Attribute_Data_List contains:
    * 2 bytes handle
    * 2 or 16 bytes data for UUID
    */
    if (p_evt->Format == UUID_TYPE_16)
    {
      uuid_size = 2;
      uuid_offset = 2;
      uuid_short_offset = 0;
      handle_uuid_pair_size = 4;
    }
    if (p_evt->Format == UUID_TYPE_128)
    {
      uuid_size = 16;
      uuid_offset = 2;
      uuid_short_offset = 12;
      handle_uuid_pair_size = 18;
    }
    UNUSED(uuid_size);

    /* Number of handle uuid pairs */
    numDesc = (p_evt->Event_Data_Length) / handle_uuid_pair_size;

    for (i = 0; i < numDesc; i++)
    {
      handle = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_UUID_Pair[uuid_offset - 2]);
      uuid = UNPACK_2_BYTE_PARAMETER(&p_evt->Handle_UUID_Pair[uuid_offset + uuid_short_offset]);

      if (uuid == PRIMARY_SERVICE_UUID)
      {
        APP_DBG_MSG("PRIMARY_SERVICE_UUID=0x%04X handle=0x%04X\n", uuid, handle);
      }
      else if (uuid == CHARACTERISTIC_UUID)
      {
        /* reset UUID & handle */
        gattCharStartHdl = 0;
        gattCharValueHdl = 0;

        gattCharStartHdl = handle;
        APP_DBG_MSG("reset - UUID & handle - CHARACTERISTIC_UUID=0x%04X CharStartHandle=0x%04X\n", uuid, handle);
      }
      else if ( (uuid == CHAR_EXTENDED_PROPERTIES_DESCRIPTOR_UUID)
             || (uuid == CLIENT_CHAR_CONFIG_DESCRIPTOR_UUID) )
      {

        APP_DBG_MSG("Descriptor UUID=0x%04X, handle=0x%04X-0x%04X-0x%04X",
                      uuid,
                      gattCharStartHdl,
                      gattCharValueHdl,
                      handle);
        if (a_ClientContext[index].ServiceChangedCharValueHdl == gattCharValueHdl)
        {
          a_ClientContext[index].ServiceChangedCharDescHdl = handle;
          APP_DBG_MSG(", Service Changed found\n");
        }
/* USER CODE BEGIN gatt_parse_descs_1 */

        else if (1)
          aci_att_clt_find_info_resp_event(p_evt);

/* USER CODE END gatt_parse_descs_1 */
        else
        {
          APP_DBG_MSG("\n");
        }
      }
      else
      {
        gattCharValueHdl = handle;

        APP_DBG_MSG("  UUID=0x%04X, handle=0x%04X", uuid, handle);

        if (uuid == DEVICE_NAME_UUID)
        {
          APP_DBG_MSG(", found GAP DEVICE_NAME_UUID\n");
        }
        else if (uuid == APPEARANCE_UUID)
        {
          APP_DBG_MSG(", found GAP APPEARANCE_UUID\n");
        }
        else if (uuid == SERVICE_CHANGED_UUID)
        {
          APP_DBG_MSG(", found GATT SERVICE_CHANGED_CHARACTERISTIC_UUID\n");
        }
/* USER CODE BEGIN gatt_parse_descs_2 */

/* USER CODE END gatt_parse_descs_2 */
        else
        {
          APP_DBG_MSG("\n");
        }
      }
    uuid_offset += handle_uuid_pair_size;
    }
  }
  else
  {
    APP_DBG_MSG("ACI_ATT_FIND_INFO_RESP_VSEVT_CODE, failed handle not found in connection table !\n");
  }

  return;
}

static void gatt_parse_notification(aci_gatt_clt_notification_event_rp0 *p_evt)
{
  APP_DBG_MSG("ACI_GATT_NOTIFICATION_VSEVT_CODE - ConnHdl=0x%04X, Attribute_Handle=0x%04X\n",
              p_evt->Connection_Handle,
              p_evt->Attribute_Handle);
/* USER CODE BEGIN gatt_parse_notification_1 */

  GATT_CLIENT_APP_Notification_evt_t notification;
  uint8_t index;

  for (index = 0; index < BLE_CFG_MAX_NBR_GATT_EVT_HANDLERS; index++)
  {
    if (a_ClientContext[index].connHdl == p_evt->Connection_Handle)
    {
      if (p_evt->Attribute_Handle == (a_ClientContext[index].ANCSNotificationSourceCharHdl + 1))
      {
        notification.Client_Evt_Opcode = ANCS_NOTIFICATION_INFO_RECEIVED_EVT;
        notification.DataTransfered.length = p_evt->Attribute_Value_Length;
        notification.DataTransfered.p_Payload = &p_evt->Attribute_Value[0];
        gatt_Notification(&notification);
      }
      if (p_evt->Attribute_Handle == (a_ClientContext[index].ANCSDataSourceCharHdl + 1))
      {
        notification.Client_Evt_Opcode = ANCS_GET_NOTIFICATION_ATTRIBUTES_RECEIVED_EVT;
        notification.DataTransfered.length = p_evt->Attribute_Value_Length;
        notification.DataTransfered.p_Payload = &p_evt->Attribute_Value[0];
        gatt_Notification(&notification);
      }
    }
  }

/* USER CODE END gatt_parse_notification_1 */

  return;
}

static void client_discover_all(void)
{
  GATT_CLIENT_APP_Discover_services(0);
  return;
}

static void gatt_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

static void gatt_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GATT_COMPLETE);
  return;
}

/* USER CODE BEGIN LF */

/* CFG_TASK_DISCOVER_ANCS_SERVICE_ID */

static void client_discover_ancs(void)
{
  UUID_t uuid = {0};
  tBleStatus result = BLE_STATUS_SUCCESS;

  /*  0x0001 Buffer must be kept valid for aci_gatt_clt_write until a gatt procedure complete is received. */
  static uint16_t enable_notif = 0x0001;

  switch (a_ClientContext[0].connStatus)
  {
    case APP_BLE_IDLE:
      if(a_ClientContext[0].state == GATT_CLIENT_APP_CONNECTED)
      {
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_DISC_SERVICE;
      }
      break; /* APP_BLE_IDLE */
    case APP_BLE_ANCS_STATE_DISC_SERVICE:
      /* Initialize the UUID structure with the ANCS service UUID */
      for (int i = 0; i < 16; i++)
        uuid.UUID_128[i] = ancs_service_uuid[15 - i];

