STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_ANCS_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
      /* Start the discovery of the primary service by UUID */
      result = aci_gatt_clt_disc_primary_service_by_uuid(a_ClientContext[0].connHdl, BLE_GATT_UNENHANCED_ATT_L2CAP_CID, 0x02, &uuid);

      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Success aci_gatt_clt_disc_primary_service_by_uuid\n");
        /* Wait for the response of the service discovery */
        APP_DBG_MSG("aci_gatt_clt_disc_primary_service_by_uuid Wait for the response\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_SERVICE;
        gatt_cmd_resp_wait();
        APP_DBG_MSG("aci_gatt_clt_disc_primary_service_by_uuid Response received\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_DISC_NOTIFICATION;
      }
      else
      {
        APP_DBG_MSG("aci_gatt_clt_disc_primary_service_by_uuid Failed, status = 0x%02X\n", result);
      }
      break; /* ANCS_STATE_DISC_SERVICE */
    case APP_BLE_ANCS_STATE_DISC_NOTIFICATION:
      if (!a_ClientContext[0].ANCSservicePresent)
      {
        APP_DBG_MSG("ANCSservicePresent = False\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_NOT_CONFIGURED;
        return;
      }
      /* Discovery Notification Source */
      for (int i = 0; i < 16; i++)
        uuid.UUID_128[i] = notification_char_uuid[15 - i];

      result = aci_gatt_clt_disc_char_by_uuid(a_ClientContext[0].connHdl,
                                              BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                              a_ClientContext[0].ANCSServiceHdl,
                                              a_ClientContext[0].ANCSServiceEndHdl,
                                              0x02,
                                              &uuid);
      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Success aci_gatt_clt_disc_char_by_uuid\n\n");

        APP_DBG_MSG("aci_gatt_clt_disc_char_by_uuid Wait for the response\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_NOTIFICATION;
        gatt_cmd_resp_wait();
        APP_DBG_MSG("aci_gatt_clt_disc_char_by_uuid Response received\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_DISC_CONTROL_POINT;
      }
      else
      {
        APP_DBG_MSG("aci_gatt_clt_disc_char_by_uuid Failed ANCS_STATE_WAITING_DISC_NOTIFICATION, status = 0x%02X\n", result);
      }
      break; /* ANCS_STATE_DISC_NOTIFICATION */
    case APP_BLE_ANCS_STATE_DISC_CONTROL_POINT:
      if (!a_ClientContext[0].ANCSservicePresent)
      {
        APP_DBG_MSG("ANCSservicePresent = False\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_NOT_CONFIGURED;
        return;
      }
      /* Discovery Control Point */
      for (int i = 0; i < 16; i++)
        uuid.UUID_128[i] = control_point_char_uuid[15 - i];
      result = aci_gatt_clt_disc_char_by_uuid(a_ClientContext[0].connHdl,
                                              BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                              a_ClientContext[0].ANCSServiceHdl,
                                              a_ClientContext[0].ANCSServiceEndHdl,
                                              0x02,
                                              &uuid);
      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Success aci_gatt_clt_disc_char_by_uuid\n");
        APP_DBG_MSG("aci_gatt_clt_disc_char_by_uuid Wait for the response\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_CONTROL_POINT;
        gatt_cmd_resp_wait();
        APP_DBG_MSG("aci_gatt_clt_disc_char_by_uuid Response received\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_DISC_DATA_SOURCE;
      }
      else
      {
        APP_DBG_MSG("aci_gatt_clt_disc_char_by_uuid Failed, status =0x%02X\n", result);
      }
      break; /* ANCS_STATE_DISC_CONTROL_POINT */

    case APP_BLE_ANCS_STATE_DISC_DATA_SOURCE:
      /* Discovery Data Source */
      if (!a_ClientContext[0].ANCSservicePresent)
      {
        APP_DBG_MSG("ANCSservicePresent = False\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_NOT_CONFIGURED;
        return;
      }
      for (int i = 0; i < 16; i++)
        uuid.UUID_128[i] = data_source_char_uuid[15 - i];

      result = aci_gatt_clt_disc_char_by_uuid(a_ClientContext[0].connHdl,
                                              BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                              a_ClientContext[0].ANCSServiceHdl,
                                              a_ClientContext[0].ANCSServiceEndHdl,
                                              0x02,
                                              &uuid);
      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Success aci_gatt_clt_disc_char_by_uuid\n\n");
        APP_DBG_MSG("aci_gatt_clt_disc_char_by_uuid Wait for the response\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_DATA_SOURCE;
        gatt_cmd_resp_wait();
        APP_DBG_MSG("aci_gatt_clt_disc_char_by_uuid Response received\n");
        /* 0x80 additional characteristic properties are defined in the Characteristic Extended Properties Descriptor*/
        if (a_ClientContext[0].ANCSControlPointValueHdl & 0x80)
        {
          a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_DISC_CTRLPOINT_EXTENDED_PROP;
        }
        else
        {
          a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_SUBSCRIBE_NOTIFICATION_SOURCE;
        }
      }
      else
      {
        APP_DBG_MSG("aci_gatt_clt_disc_char_by_uuid Failed, status =0x%02X\n", result);
      }
      break; /* ANCS_STATE_DISC_DATA_SOURCE */
    case APP_BLE_ANCS_STATE_SUBSCRIBE_NOTIFICATION_SOURCE:
      /* 0x10 means that a notification is present */
      if ((a_ClientContext[0].ANCSNotificationSourceCharHdl != 0) && (a_ClientContext[0].ANCSNotificationSourceValueHdl & 0x10))
      {
        result = aci_gatt_clt_write(a_ClientContext[0].connHdl,
                                    BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                    a_ClientContext[0].ANCSNotificationSourceCharHdl + 2,
                                    0x02,
                                    (uint8_t *)&enable_notif);
        if (result == BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("Success aci_gatt_clt_write\n");
          APP_DBG_MSG("aci_gatt_clt_write Wait for the response\n");
          a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_SUBSCRIBE_NOTIFICATION_SOURCE;
          gatt_cmd_resp_wait();
          APP_DBG_MSG("aci_gatt_clt_write Response received\n");
          a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_SUBSCRIBE_DATA_SOURCE;
        }
        else
        {
          APP_DBG_MSG("aci_gatt_clt_write Failed, status = 0x%02X\n", result);
        }
      }
      break; /* ANCS_STATE_SUBSCRIBE_NOTIFICATION_SOURCE */
    case APP_BLE_ANCS_STATE_SUBSCRIBE_DATA_SOURCE:
      /* 0x10 means that a notification is present */
      if ((a_ClientContext[0].ANCSDataSourceCharHdl != 0) && (a_ClientContext[0].ANCSDataSourceValueHdl & 0x10))
      {
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_SUBSCRIBE_DATA_SOURCE;
        result = aci_gatt_clt_write(a_ClientContext[0].connHdl,
                                    BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                    a_ClientContext[0].ANCSDataSourceCharHdl + 2,
                                    2,
                                    (uint8_t *)&enable_notif);
        if (result == BLE_STATUS_SUCCESS)
        {
          APP_DBG_MSG("Success aci_gatt_clt_write\n\n");

          APP_DBG_MSG("aci_gatt_clt_write Wait for the response\n");
          a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_SUBSCRIBE_DATA_SOURCE;
          gatt_cmd_resp_wait();
          APP_DBG_MSG("aci_gatt_clt_write Response received\n");
          a_ClientContext[0].connStatus = APP_BLE_ANCS_COMPLETE_DISCOVER;
        }
        else
        {
          APP_DBG_MSG("aci_gatt_clt_write Failed, status =0x%02X\n", result);
        }
      }
      break; /* ANCS_STATE_SUBSCRIBE_DATA_SOURCE */
    case APP_BLE_ANCS_STATE_DISC_CTRLPOINT_EXTENDED_PROP:
      {
      uint16_t min_char_handle, max_char_handle;
      min_char_handle = MIN(a_ClientContext[0].ANCSNotificationSourceCharHdl, a_ClientContext[0].ANCSDataSourceCharHdl);
      max_char_handle = MAX(a_ClientContext[0].ANCSNotificationSourceCharHdl, a_ClientContext[0].ANCSDataSourceCharHdl);
      if (a_ClientContext[0].ANCSControlPointExtendedCharHdl > max_char_handle)
      {
        result = aci_gatt_clt_disc_all_char_desc(a_ClientContext[0].connHdl,
                                                 BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                                 a_ClientContext[0].ANCSControlPointExtendedCharHdl + 1,
                                                 a_ClientContext[0].ANCSServiceEndHdl);
      }
      else
      {
        if (a_ClientContext[0].ANCSControlPointExtendedCharHdl < min_char_handle)
        {
          result = aci_gatt_clt_disc_all_char_desc(a_ClientContext[0].connHdl,
                                                   BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                                   a_ClientContext[0].ANCSControlPointExtendedCharHdl + 1,
                                                   min_char_handle - 1);
        }
        else
        {
          result = aci_gatt_clt_disc_all_char_desc(a_ClientContext[0].connHdl,
                                                   BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                                   a_ClientContext[0].ANCSControlPointExtendedCharHdl + 1,
                                                   max_char_handle - 1);
        }
      }
      if (result != BLE_STATUS_SUCCESS)
      {
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_NOT_CONFIGURED;
        a_ClientContext[0].ANCSerror_proc = ERROR_ANCS_DISCOVERY_CHARACTERISTIC_DESC;
        APP_DBG_MSG("Error in aci_gatt_clt_disc_all_char_desc() = 0x%02X (DISC CTRL EXTENDED PROP STATE)\n", result);
      }
      else
      {
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_CTRLPOINT_EXTENDED_PROP;
        APP_DBG_MSG("Success aci_gatt_clt_disc_all_char_desc \n");
        APP_DBG_MSG("aci_gatt_clt_disc_all_char_desc Wait for the response\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_CTRLPOINT_EXTENDED_PROP;
        gatt_cmd_resp_wait();
        APP_DBG_MSG("aci_gatt_clt_disc_all_char_desc Response received\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_READ_CTRLPOINT_EXTENDED_PROP_VALUE;
      }
      }
      break; /* ANCS_STATE_DISC_CTRLPOINT_EXTENDED_PROP */
    case APP_BLE_ANCS_STATE_READ_CTRLPOINT_EXTENDED_PROP_VALUE:
      result = aci_gatt_clt_read(a_ClientContext[0].connHdl,
                                 BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                 a_ClientContext[0].ANCSControlPointExtendedCharHdl);
      if (result == BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("Success aci_gatt_clt_read\n\n");

        APP_DBG_MSG("aci_gatt_clt_read Wait for the response\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_READ_CTRLPOINT_EXTENDED_PROP_VALUE;
        gatt_cmd_resp_wait();
        APP_DBG_MSG("aci_gatt_clt_read Response received\n");
        a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_SUBSCRIBE_NOTIFICATION_SOURCE;
      }
      else
      {
        APP_DBG_MSG("aci_gatt_clt_read Failed, status =0x%02X\n", result);
      }
      break; /* ANCS_STATE_READ_CTRLPOINT_EXTENDED_PROP_VALUE */
	  default:
		  break;
  }

  /* ANCS_COMPLETE_DISCOVER is used to end the procedure of discovering ANCS services and characteristics */
  if (a_ClientContext[0].connStatus != APP_BLE_ANCS_COMPLETE_DISCOVER)
  {
    if(a_ClientContext[0].state == GATT_CLIENT_APP_CONNECTED)
    {
      UTIL_SEQ_SetTask(1U << CFG_TASK_CLIENT_DISCOVER_ANCS, CFG_SEQ_PRIO_0);
    }
  }
  return;
}


static void notification_ancs(void)
{
  for(uint8_t index=0; index<MAX_ANCS_NOTIFICATION; index++)
  {
    if(ancs_notification_list[index].used == USED)
    {
      switch (ancs_notification_list[index].status)
      {
        case TO_UPDATE:
          /* TO_UPDATE same action of the ADDED case to update thenotification data */
        case ADDED:
          ancs_notification_list[index].status = GET_NOTIFICATION_ATTRIBUTES;
          
          APP_DBG_MSG("Notification GET_NOTIFICATION_ATTRIBUTES.\n");

          APP_DBG_MSG("Notification : EventID             0x%02X\n", ancs_notification_list[index].evID);
          APP_DBG_MSG("               EventFlags          0x%02X\n", ancs_notification_list[index].evFlag);
          APP_DBG_MSG("               CategoryID          0x%02X\n", ancs_notification_list[index].catID);
          APP_DBG_MSG("               CategoryCount       0x%02X\n", ancs_notification_list[index].catCount);
          APP_DBG_MSG("               UID           0x%08X\n", ancs_notification_list[index].notifUID);

          /* This application will show all data related to the notification just received. */
          gatt_ShowANCSPacket(&ancs_notification_list[index]);
          break; /* ADDED */
        
        default:
          break;
      }

