STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_ANCS_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
    }
  }
  return;
}

void gatt_ShowANCSPacket(ANCS_NotificationList_type *notification)
{
  uint8_t notificationAttributeCommand[1 + 4 + COMMAND_DATA_SIZE] = {0};
  
  /* CommandID: Should be set to 0 (CommandIDGetNotificationAttributes). */
  notificationAttributeCommand[0] = CommandIDGetNotificationAttributes;
  /* Notification ID - from uint32_t to uint8_t*/
  notificationAttributeCommand[1] = notification->notifUID & 0x000000FF;
  notificationAttributeCommand[2] = (notification->notifUID & 0x0000FF00) >> 8;
  notificationAttributeCommand[3] = (notification->notifUID & 0x00FF0000) >> 16;
  notificationAttributeCommand[4] = (notification->notifUID & 0xFF000000) >> 24;
  /* App Identifier */
  notificationAttributeCommand[5+0] = NotificationAttributeIDAppIdentifier;
  /* Title */
  notificationAttributeCommand[5+1] = NotificationAttributeIDTitle;
  /* Title Length */
  notificationAttributeCommand[5+2] = ANCS_TITLE_MAX_LENGTH;
  notificationAttributeCommand[5+3] = 0;
  /* Subtitle */
  notificationAttributeCommand[5+4] = NotificationAttributeIDSubtitle;
  /* Subtitle Length */
  notificationAttributeCommand[5+5] = ANCS_SUBTITLE_MAX_LENGTH;
  notificationAttributeCommand[5+6] = 0;
  /* Message */
  notificationAttributeCommand[5+7] = NotificationAttributeIDMessage;
  /* Message Length */
  notificationAttributeCommand[5+8] = ANCS_MESSAGE_MAX_LENGTH_LSB;
  notificationAttributeCommand[5+9] = ANCS_MESSAGE_MAX_LENGTH_MSB;
  /* Message Size */
  notificationAttributeCommand[5+10] = NotificationAttributeIDMessageSize;
  /* Date */
  notificationAttributeCommand[5+11] = NotificationAttributeIDDate;
  /* Positive Action Label */
  notificationAttributeCommand[5+12] = NotificationAttributeIDPositiveActionLabel;
  /* Negative Action Label */
  notificationAttributeCommand[5+13] = NotificationAttributeIDNegativeActionLabel;

  /* Write specific commands to the Control Point characteristic to retrieve information about the notification */
  tBleStatus result = aci_gatt_clt_write(a_ClientContext[0].connHdl,
                                         BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                         a_ClientContext[0].ANCSControlPointCharHdl+1, 
                                         (uint16_t)(1 + 4 + COMMAND_DATA_SIZE), 
                                         notificationAttributeCommand);
  if (result != BLE_STATUS_SUCCESS)
  {
      APP_DBG_MSG("Failed to send GetNotificationAttributesCommand, status = 0x%02X\n", result);
  }
  else
  {
      APP_DBG_MSG("GetNotificationAttributesCommand sent successfully\n");
      APP_DBG_MSG("aci_gatt_clt_write Waiting for response...\n");
      a_ClientContext[0].state = GATT_CLIENT_APP_GET_NOTIFICATION_ATTRIBUTES_WAITING;
      gatt_cmd_resp_wait();
      APP_DBG_MSG("aci_gatt_clt_write Response received\n");
  }
  
}


/**
 * @brief  This event is generated when a Find By Type Value Response is received from the server.
 *         The response contains information about the handles that match the requested attribute type and value.
 * @param  p_event Pointer to the event structure containing the response data.
 * @retval None
 */
void aci_att_clt_find_by_type_value_resp_event(aci_att_clt_find_by_type_value_resp_event_rp0 *p_event)
{
  if (a_ClientContext[0].connStatus == APP_BLE_ANCS_STATE_WAITING_DISC_SERVICE)
  {
    a_ClientContext[0].ANCSservicePresent = TRUE;
    if ((p_event->Connection_Handle != a_ClientContext[0].connHdl) || (p_event->Num_of_Handle_Pair != 1))
    {
      a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_NOT_CONFIGURED;
      a_ClientContext[0].ANCSerror_proc = ERROR_MORE_THAN_ONE_ANCS_PRESENT;
      return;
    }
    a_ClientContext[0].ANCSServiceHdl = p_event->Attribute_Group_Handle_Pair[0].Found_Attribute_Handle;
    a_ClientContext[0].ANCSServiceEndHdl = p_event->Attribute_Group_Handle_Pair[0].Group_End_Handle;
    a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_SERVICE_SUCCESS;
  }
}

/**
 * @brief This event can be generated during a "Discover Characteristics By UUID"
 * procedure or a "Read using Characteristic UUID" procedure.
 *
 * During a "Discover Characteristics By UUID" procedure, Attribute_Value is a
 * characteristic declaration as defined in Bluetooth Core spec (vol.3, Part G, ch. 3.3.1),
 * i.e. it is composed by: Characteristic Properties (1 octet), Characteristic Value Handle
 * (2 octets) and Characteristic UUID (2 or 16 octets). During a "Read using Characteristic UUID"
 * procedure, Attribute_Value is the value of the characteristic.
 *
 * @param p_event Pointer to the event structure containing the response data.
 *
 * @retval None
 */
void aci_gatt_clt_disc_read_char_by_uuid_resp_event(aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0 *p_event)
{
  if (p_event->Connection_Handle != a_ClientContext[0].connHdl)
  {
    a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_NOT_CONFIGURED;
    a_ClientContext[0].ANCSerror_proc = ERROR_WRONG_CONN_HANDLE;
    return;
  }

  APP_DBG_MSG(">>== aci_gatt_clt_disc_read_char_by_uuid_resp_event\n");

  switch (a_ClientContext[0].connStatus)
  {
  case APP_BLE_ANCS_STATE_WAITING_DISC_NOTIFICATION:
    /* Discovery Notification Source */
    /* 0x10 means that a notification is present */
    if ((p_event->Attribute_Value[0] & 0x10) == 0)
    {
      a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_NOT_CONFIGURED;
      a_ClientContext[0].ANCSerror_proc = ERROR_WRONG_CHARAC_PROP;
      return;
    }
    a_ClientContext[0].ANCSNotificationSourceCharHdl = p_event->Attribute_Handle;
    a_ClientContext[0].ANCSNotificationSourceValueHdl = p_event->Attribute_Value[0];
    a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_NOTIFICATION_SUCCESS;
    break; /* ANCS_STATE_WAITING_DISC_NOTIFICATION*/
  case APP_BLE_ANCS_STATE_WAITING_DISC_CONTROL_POINT:
    /* Discovery Control Point */
    if ((p_event->Attribute_Value[0] & 0x08) == 0)
    {
      a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_NOT_CONFIGURED;
      a_ClientContext[0].ANCSerror_proc = ERROR_WRONG_CHARAC_PROP;
      return;
    }
    a_ClientContext[0].ANCSControlPointCharHdl = p_event->Attribute_Handle;
    a_ClientContext[0].ANCSControlPointValueHdl = p_event->Attribute_Value[0];
    a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_CONTROL_POINT_SUCCESS;
    break; /* ANCS_STATE_WAITING_DISC_CONTROL_POINT*/
  case APP_BLE_ANCS_STATE_WAITING_DISC_DATA_SOURCE:
    /* Discovery Data Source */
    /* 0x10 means that a notification is present */
    if ((p_event->Attribute_Value[0] & 0x10) == 0)
    {
      a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_NOT_CONFIGURED;
      a_ClientContext[0].ANCSerror_proc = ERROR_WRONG_CHARAC_PROP;
      return;
    }
    a_ClientContext[0].ANCSDataSourceCharHdl = p_event->Attribute_Handle;
    a_ClientContext[0].ANCSDataSourceValueHdl = p_event->Attribute_Value[0];
    a_ClientContext[0].connStatus = APP_BLE_ANCS_STATE_WAITING_DISC_DATA_SOURCE_SUCCESS;
    break; /* ANCS_STATE_WAITING_DISC_DATA_SOURCE*/
	default:
		break;
  }

