STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB05KZ/Applications/BLE/BLE_ANCS_CentralPeripheral/STM32_BLE/App/gatt_client_app.c
}

/**
 * @brief This event is generated in response to a Find Information Request during a
 * discovery procedure for all the characteristic descriptors.
 *
 * @param p_event Pointer to the event structure containing the response data.
 *
 * @retval None
 */
void aci_att_clt_find_info_resp_event(aci_att_clt_find_info_resp_event_rp0 *p_event)
{
  uint8_t i;
  uint16_t app_handle, app_uuid;

  if ((p_event->Format != 1) || (a_ClientContext[0].connHdl != p_event->Connection_Handle))
    return;

  for (i = 0; i < p_event->Event_Data_Length; i += 4)
  {
    app_handle = p_event->Handle_UUID_Pair[i] | (uint16_t)(p_event->Handle_UUID_Pair[i + 1] << 8);
    app_uuid = p_event->Handle_UUID_Pair[i + 2] | (uint16_t)(p_event->Handle_UUID_Pair[i + 3] << 8);

    if (app_uuid == CHAR_EXTENDED_PROP_DESC_UUID)
    {
      a_ClientContext[0].ANCSControlPointExtendedCharHdl = app_handle;
      /* APP_DBG_MSG(" ANCSControlPointExtendedCharHdl: 0x%04X\n", a_ClientContext[0].ANCSControlPointExtendedCharHdl); */
      break;
    }
  }
}

/**
 * @brief This event is generated in response to a Read Request.
 *
 * @param p_event Pointer to the structure containing the read response event data.
 *
 * This function handles the read response event by invoking the ANCS_ReadResp_Callback
 * with the connection handle, event data length, and attribute value from the event.
 *
 * @param p_event->Connection_Handle Connection handle related to the response.
 * @param p_event->Event_Data_Length Length of the attribute value data.
 * @param p_event->Attribute_Value The value of the attribute.
 */
void aci_att_clt_read_resp_event(aci_att_clt_read_resp_event_rp0 *p_event)
{
  if (a_ClientContext[0].connStatus == APP_BLE_ANCS_STATE_WAITING_READ_CTRLPOINT_EXTENDED_PROP_VALUE)
  {
    a_ClientContext[0].ANCSControlPointExtendedValueHdl = p_event->Attribute_Value[0] | (uint16_t)(p_event->Attribute_Value[1] << 8);
  }
}


/**
 * @brief Event handler for GATT client indication event.
 *        This function is called when an indication is received from the server.
 *        It confirms the indication by calling aci_gatt_clt_confirm_indication.
 * @param p_event Pointer to the event structure containing the connection handle.
 */
void aci_gatt_clt_indication_event(aci_gatt_clt_indication_event_rp0 *p_event)
{
  APP_DBG_MSG(">>== aci_gatt_clt_indication_event\n");
  aci_gatt_clt_confirm_indication(p_event->Connection_Handle, p_event->CID);
}

void printANCSNotification(ANCS_NotificationList_type *notification) 
{
    APP_DBG_MSG("Notification:\n");
    APP_DBG_MSG("  Used: %d\n", notification->used);
    APP_DBG_MSG("  Event ID: %d\n", notification->evID);
    APP_DBG_MSG("  Event Flags: %d\n", notification->evFlag);
    APP_DBG_MSG("  Category ID: %d\n", notification->catID);
    APP_DBG_MSG("  Category Count: %d\n", notification->catCount);
    APP_DBG_MSG("  Notification UID: 0x%08X\n", notification->notifUID);

    APP_DBG_MSG("  Notification Data:\n");
    APP_DBG_MSG("    App Identifier: ");
    for (int i = 0; i < 0x13; i++) {
        APP_DBG_MSG("%c", notification->notifData.appIdentifier[i]);
    }
    APP_DBG_MSG("\n");

    APP_DBG_MSG("    Title: ");
    for (int i = 0; i < ANCS_TITLE_MAX_LENGTH; i++) {
        APP_DBG_MSG("%c", notification->notifData.idTitle[i]);
    }
    APP_DBG_MSG("\n");

    APP_DBG_MSG("    Subtitle: ");
    for (int i = 0; i < ANCS_SUBTITLE_MAX_LENGTH; i++) {
        APP_DBG_MSG("%c", notification->notifData.idSubtitle[i]);
    }
    APP_DBG_MSG("\n");

    APP_DBG_MSG("    Message: ");
    for (int i = 0; i < ANCS_MESSAGE_MAX_LENGTH; i++) {
        APP_DBG_MSG("%c", notification->notifData.idMessage[i]);
    }
    APP_DBG_MSG("\n");

    APP_DBG_MSG("    Date: ");
    for (int i = 0; i < 15; i++) {
        APP_DBG_MSG("%c", notification->notifData.idDate[i]);
    }
    APP_DBG_MSG("\n");


    APP_DBG_MSG("    Positive Action Label: ");
    for (int i = 0; i < 0x13; i++) {
        APP_DBG_MSG("%c", notification->notifData.idPositiveActionLabel[i]);
    }
    APP_DBG_MSG("\n");

    APP_DBG_MSG("    Negative Action Label: ");
    for (int i = 0; i < 10; i++) {
        APP_DBG_MSG("%c", notification->notifData.idNegativeActionLabel[i]);
    }
    APP_DBG_MSG("\n");
    
}

uint8_t index_current_notification=0;
uint32_t current_notification_uid = 0x0;

void GATT_Button1Action(void)
{
  uint32_t i=0;
  
  while(1)
  {
    
    if(index_current_notification==MAX_ANCS_NOTIFICATION)
    {
      index_current_notification = 0;
    }

    if(ancs_notification_list[index_current_notification].notifUID == current_notification_uid)
    {
      index_current_notification++;
    }
    
    if(ancs_notification_list[index_current_notification].used == USED)
    {
      current_notification_uid = ancs_notification_list[index_current_notification].notifUID;
      printANCSNotification(&ancs_notification_list[index_current_notification]);
      APP_DBG_MSG("Press push button 1 to show next notification.\n");
      APP_DBG_MSG("Press push button 2 to perform the Positive Action [%s] on the 0x%08X UID.\n", ancs_notification_list[index_current_notification].notifData.idPositiveActionLabel ,current_notification_uid);
      APP_DBG_MSG("Press push button 3 to perform the Negative Action [%s] on the 0x%08X UID.\n", ancs_notification_list[index_current_notification].notifData.idNegativeActionLabel, current_notification_uid);
      break;
    }
    
    i++;
    index_current_notification++;
    
    if(i==MAX_ANCS_NOTIFICATION)
    {
      index_current_notification = 0;
      current_notification_uid = 0;
      break;
    }
    
  }
  return;
}

void GATT_Button2Action(void)
{
  if(ancs_notification_list[index_current_notification].used == USED)
  {
    if(ancs_notification_list[index_current_notification].notifUID == current_notification_uid)
    {
      APP_DBG_MSG("Positive Action [%s] on the 0x%08X UID.\n", ancs_notification_list[index_current_notification].notifData.idPositiveActionLabel , current_notification_uid);
      uint8_t notificationAction[1 + 4 + 1] = {0};
      
      notificationAction[0] = CommandIDPerformNotificationAction;
      notificationAction[1] =  current_notification_uid & 0x000000FF;
      notificationAction[2] = (current_notification_uid & 0x0000FF00) >> 8;
      notificationAction[3] = (current_notification_uid & 0x00FF0000) >> 16;
      notificationAction[4] = (current_notification_uid & 0xFF000000) >> 24;
      notificationAction[5] = ActionIDPositive;

      /* Write specific commands to the Control Point characteristic to retrieve information about the notification */
      tBleStatus result = aci_gatt_clt_write(a_ClientContext[0].connHdl,
                                             BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                             a_ClientContext[0].ANCSControlPointCharHdl+1, 
                                             (uint16_t)(1 + 4 + 1), 
                                             notificationAction);
      if (result != BLE_STATUS_SUCCESS)
      {
          APP_DBG_MSG("Failed to send PerformNotificationAction, status = 0x%02X\n", result);
      }
      else
      {
          APP_DBG_MSG("PerformNotificationAction sent successfully\n");
          APP_DBG_MSG("aci_gatt_clt_write Waiting for response...\n");
          a_ClientContext[0].state = GATT_CLIENT_APP_GET_NOTIFICATION_ATTRIBUTES_WAITING;
          gatt_cmd_resp_wait();
          APP_DBG_MSG("aci_gatt_clt_write Response received\n");
      }
    }
  }
  return;
}

void GATT_Button3Action(void)
{
  if(ancs_notification_list[index_current_notification].used == USED)
  {
    if(ancs_notification_list[index_current_notification].notifUID == current_notification_uid)
    {
      APP_DBG_MSG("Negative Action [%s] on the 0x%08X UID.\n", ancs_notification_list[index_current_notification].notifData.idNegativeActionLabel , current_notification_uid);
      uint8_t notificationAction[1 + 4 + 1] = {0};
      
      notificationAction[0] = CommandIDPerformNotificationAction;
      notificationAction[1] =  current_notification_uid & 0x000000FF;
      notificationAction[2] = (current_notification_uid & 0x0000FF00) >> 8;
      notificationAction[3] = (current_notification_uid & 0x00FF0000) >> 16;
      notificationAction[4] = (current_notification_uid & 0xFF000000) >> 24;
      notificationAction[5] = ActionIDNegative;

      /* Write specific commands to the Control Point characteristic to retrieve information about the notification */
      tBleStatus result = aci_gatt_clt_write(a_ClientContext[0].connHdl,
                                             BLE_GATT_UNENHANCED_ATT_L2CAP_CID,
                                             a_ClientContext[0].ANCSControlPointCharHdl+1, 
                                             (uint16_t)(1 + 4 + 1), 
                                             notificationAction);
      if (result != BLE_STATUS_SUCCESS)
      {
          APP_DBG_MSG("Failed to send PerformNotificationAction, status = 0x%02X\n", result);
      }
      else
      {
          APP_DBG_MSG("PerformNotificationAction sent successfully\n");
          APP_DBG_MSG("aci_gatt_clt_write Waiting for response...\n");
          a_ClientContext[0].state = GATT_CLIENT_APP_GET_NOTIFICATION_ATTRIBUTES_WAITING;
          gatt_cmd_resp_wait();
          APP_DBG_MSG("aci_gatt_clt_write Response received\n");
      }
    }
  }

  return;
}


/* USER CODE END LF */
